import { useState } from "react";
import styles from "./introduction.module.css";

function Introduction() {
  const [isDetailsOpen, setIsDetailsOpen] = useState(false);
  return (
    <div className={styles["product-introduction"]}>
      <div className={styles["description-container"]}>
        <div className={styles["description-right"]}>
          <h3 className={styles["description-title"]}>معرفی</h3>
          <div
            className={
              styles[isDetailsOpen ? "all-details-open" : "all-details"] +
              " " +
              styles["description-text"] 

            }
            id={styles["descText"]}
          >
            سری لپ‌تاپ‌های Tuf ایسوی همواره جایگاه ویژه‌ای در بازار رقابتی
            لپ‌تاپ‌های مخصوص بازی داشته و توجه بسیاری از کاربران را به خود جلب
            می‌کنند. لپ‌تاپ TUF Gaming F17 FX707VV به عنوان یکی از بهترین میان
            رده‌های موجود برای تجربه‌ی بازی‌های کامپیوتری با گرافیک و نرخ فریم
            خوب محسوب می‌شود‌. پردازنده 13620H از 10 هسته و 16 رشته پردازشی
            استفاده می‌کند و با سقف فرکانس 4.9 گیگاهرتزی به خوبی از پس
            سنگین‌ترین پردازش‌ها هم برمی‌آید. ترکیب پردازنده Core i7 نسل 13 با
            پردازنده گرافیکی Geforce RTX 4060 امکان تجربه جدیدتری بازی‌ها با
            تنظیمات گرافیکی بالا را فراهم می‌کند و تجربه روان و لذت بخشی به
            همراه دارد. این پردازنده گرافیکی تا 140 وات توان به خود اختصاص
            می‌دهد و به لطف پشتیبانی از فناوری DLSS3 می‌تواند در سنگین‌ترین
            بازی‌ها هم نرخ فریم بالایی ارائه کند. رم DDR5 با سرعت 4800 مگاهرتز
            گزینه‌ی ایده‌آلی برای مولتی تسکینگ بوده و حافظه پرسرعت SSD نسل 4،
            زمان بوت سیستم و انتقال فایل را به شکل چشم‌گیری کاهش می‌دهد. مکمل
            این سخت‌افزار قدرتمند، صفحه نمایش 144 هرتزی با ابعاد بزرگ 17.3 اینچی
            است که از رزولوشن Full HD برخوردار است و ضمن ارائه امکاناتی مانند
            G-Sync، دقت رنگ بسیار بالایی هم دارد. با وجود امکانات متعدد و
            سخت‌افزار قدرتمند، این لپ‌تاپ وزن 2.6 کیلوگرمی داشته و همچنان قابلیت
            حمل مناسبی دارد. باتری 4 سلولی با ظرفیت 90 وات ساعتی، درگاه
            تاندربولت 4، نورپردازی کیبورد و قابلیت ارتقای رم و حافظه از دیگر
            ویژگی‌های TUF Gaming F17 FX707VV به شمار می‌آیند. به این ترتیب این
            لپ‌تاپ می‌تواند یکی از بهترین و جدی‌ترین گزینه‌ها در بازه قیمتی خود
            باشد و تا چند سال پیش رو نیاز کاربر برای بازی کردن و پردازش‌های
            سنگین را برطرف کند. سری لپ‌تاپ‌های Tuf ایسوی همواره جایگاه ویژه‌ای
            در بازار رقابتی لپ‌تاپ‌های مخصوص بازی داشته و توجه بسیاری از کاربران
            را به خود جلب می‌کنند. لپ‌تاپ TUF Gaming F17 FX707VV به عنوان یکی از
            بهترین میان رده‌های موجود برای تجربه‌ی بازی‌های کامپیوتری با گرافیک
            و نرخ فریم خوب محسوب می‌شود‌. پردازنده 13620H از 10 هسته و 16 رشته
            پردازشی استفاده می‌کند و با سقف فرکانس 4.9 گیگاهرتزی به خوبی از پس
            سنگین‌ترین پردازش‌ها هم برمی‌آید. ترکیب پردازنده Core i7 نسل 13 با
            پردازنده گرافیکی Geforce RTX 4060 امکان تجربه جدیدتری بازی‌ها با
            تنظیمات گرافیکی بالا را فراهم می‌کند و تجربه روان و لذت بخشی به
            همراه دارد. این پردازنده گرافیکی تا 140 وات توان به خود اختصاص
            می‌دهد و به لطف پشتیبانی از فناوری DLSS3 می‌تواند در سنگین‌ترین
            بازی‌ها هم نرخ فریم بالایی ارائه کند. رم DDR5 با سرعت 4800 مگاهرتز
            گزینه‌ی ایده‌آلی برای مولتی تسکینگ بوده و حافظه پرسرعت SSD نسل 4،
            زمان بوت سیستم و انتقال فایل را به شکل چشم‌گیری کاهش می‌دهد. مکمل
            این سخت‌افزار قدرتمند، صفحه نمایش 144 هرتزی با ابعاد بزرگ 17.3 اینچی
            است که از رزولوشن Full HD برخوردار است و ضمن ارائه امکاناتی مانند
            G-Sync، دقت رنگ بسیار بالایی هم دارد. با وجود امکانات متعدد و
            سخت‌افزار قدرتمند، این لپ‌تاپ وزن 2.6 کیلوگرمی داشته و همچنان قابلیت
            حمل مناسبی دارد. باتری 4 سلولی با ظرفیت 90 وات ساعتی، درگاه
            تاندربولت 4، نورپردازی کیبورد و قابلیت ارتقای رم و حافظه از دیگر
            ویژگی‌های TUF Gaming F17 FX707VV به شمار می‌آیند. به این ترتیب این
            لپ‌تاپ می‌تواند یکی از بهترین و جدی‌ترین گزینه‌ها در بازه قیمتی خود
            باشد و تا چند سال پیش رو نیاز کاربر برای بازی کردن و پردازش‌های
            سنگین را برطرف کند. سری لپ‌تاپ‌های Tuf ایسوی همواره جایگاه ویژه‌ای
            در بازار رقابتی لپ‌تاپ‌های مخصوص بازی داشته و توجه بسیاری از کاربران
            را به خود جلب می‌کنند. لپ‌تاپ TUF Gaming F17 FX707VV به عنوان یکی از
            بهترین میان رده‌های موجود برای تجربه‌ی بازی‌های کامپیوتری با گرافیک
            و نرخ فریم خوب محسوب می‌شود‌. پردازنده 13620H از 10 هسته و 16 رشته
            پردازشی استفاده می‌کند و با سقف فرکانس 4.9 گیگاهرتزی به خوبی از پس
            سنگین‌ترین پردازش‌ها هم برمی‌آید. ترکیب پردازنده Core i7 نسل 13 با
            پردازنده گرافیکی Geforce RTX 4060 امکان تجربه جدیدتری بازی‌ها با
            تنظیمات گرافیکی بالا را فراهم می‌کند و تجربه روان و لذت بخشی به
            همراه دارد. این پردازنده گرافیکی تا 140 وات توان به خود اختصاص
            می‌دهد و به لطف پشتیبانی از فناوری DLSS3 می‌تواند در سنگین‌ترین
            بازی‌ها هم نرخ فریم بالایی ارائه کند. رم DDR5 با سرعت 4800 مگاهرتز
            گزینه‌ی ایده‌آلی برای مولتی تسکینگ بوده و حافظه پرسرعت SSD نسل 4،
            زمان بوت سیستم و انتقال فایل را به شکل چشم‌گیری کاهش می‌دهد. مکمل
            این سخت‌افزار قدرتمند، صفحه نمایش 144 هرتزی با ابعاد بزرگ 17.3 اینچی
            است که از رزولوشن Full HD برخوردار است و ضمن ارائه امکاناتی مانند
            G-Sync، دقت رنگ بسیار بالایی هم دارد. با وجود امکانات متعدد و
            سخت‌افزار قدرتمند، این لپ‌تاپ وزن 2.6 کیلوگرمی داشته و همچنان قابلیت
            حمل مناسبی دارد. باتری 4 سلولی با ظرفیت 90 وات ساعتی، درگاه
            تاندربولت 4، نورپردازی کیبورد و قابلیت ارتقای رم و حافظه از دیگر
            ویژگی‌های TUF Gaming F17 FX707VV به شمار می‌آیند. به این ترتیب این
            لپ‌تاپ می‌تواند یکی از بهترین و جدی‌ترین گزینه‌ها در بازه قیمتی خود
            باشد و تا چند سال پیش رو نیاز کاربر برای بازی کردن و پردازش‌های
            سنگین را برطرف کند.
          </div>
        </div>

        <div className={styles["description-left"]}>
          <img src="/images/products/1.png" alt="" />
        </div>
      </div>
      <button
        onClick={() => setIsDetailsOpen(!isDetailsOpen)}
        className={styles["toggle-btn"]}
        id={styles["toggleDesc"]}
      >
        {isDetailsOpen ? " نمایش جزییات بیشتر" : " نمایش جزییات کمتر"}
      </button>
    </div>
  );
}

export default Introduction;
