import Link from "next/link";
import Sections from "@/components/modules/about-us/Sections";
import styles from "@/styles/about-us.module.css";

function page() {
  return (
    <div className={styles.main}>
      <div className="container">
        <section className={styles["about-us-title"]}>
          <h1>درباره تک شاپ</h1>
          <p>
            تک‌شاپ فعالیت خودش رو از سال ۱۳۹۸ با هدف ساده‌سازی خرید آنلاین
            محصولات دیجیتال آغاز کرد. <br /> ما کارمون رو با فروش موبایل و
            لپ‌تاپ شروع کردیم، ولی خیلی زود به یکی از فروشگاه‌های کامل و تخصصی
            در حوزه تکنولوژی تبدیل شدیم. ما باور داریم خرید دیجیتال، باید ساده،
            سریع و با پشتوانه‌ی مطمئن باشه. برای همین توی هر مرحله، از انتخاب
            محصول تا دریافت سفارش، کنار شماییم.
          </p>
        </section>
        <section className={styles["about-us-desc"]}>
          <h2>تک‌شاپ فقط یه فروشگاه نیست؛ یه تیمه!</h2>
          <p>
            در این بخش، اعضای تیم رو به چند دسته تقسیم می‌کنیم و برای هر دسته یه
            توضیح کوتاه می‌نویسیم:
          </p>
        </section>

        <div>
          <Sections
            title={"تیم توسعه و فناوری"}
            revers={false}
            img={"./images/about-us-image/1.png"}
          >
            تیم توسعه مغز متفکر پشت عملکرد دقیق و بدون نقص تک‌شاپه. <br />
            برنامه‌نویس‌ها و توسعه‌دهنده‌های ما روی هر کلیک، هر اسکرول و هر
            تعامل کوچیکی که شما با سایت دارید حساسن. از طراحی رابط کاربری (UI)
            گرفته تا تجربه کاربری (UX)، از امنیت اطلاعات کاربران تا بهینه‌سازی
            سرعت سایت، همه چیز توسط این تیم انجام می‌شه. <br />
            وقتی سایت رو باز می‌کنی و با خیال راحت خرید می‌کنی، بدون که یه تیم
            حرفه‌ای شبانه‌روز داره زیرساختش رو محکم نگه می‌داره.
          </Sections>

          <Sections
            title={"تیم پردازش و لجستیک"}
            revers={true}
            img={"./images/about-us-image/2.png"}
          >
            هیچ سفارشی بدون دست‌های دقیق این تیم به مقصد نمی‌رسه! <br /> این تیم
            وظیفه داره بعد از ثبت سفارش، اون رو با دقت بالا پردازش، بسته‌بندی و
            برای ارسال آماده کنه. از انبارداری هوشمند و مرتب تا هماهنگی با
            شرکت‌های حمل‌ونقل، همه‌چیز باید سریع و بی‌اشتباه انجام بشه. <br />{" "}
            برای ما مهمه که سفارش شما سریع، سالم و دقیق به دستتون برسه؛ این
            وظیفه‌ی تیم لجستیکه.
          </Sections>

          <Sections
            title={"تیم پشتیبانی و ارتباط با مشتری"}
            revers={false}
            img={"./images/about-us-image/3.png"}
          >
            اینجا جاییه که صدای مشتری برای ما شنیده می‌شه. <br /> اگر سوالی
            داری، مشکلی پیش اومده یا اصلاً فقط می‌خوای از روند سفارشت باخبر بشی،
            تیم پشتیبانی همیشه پاسخ‌گوه. با خوش‌رویی، سرعت بالا و دلسوزی تلاش
            می‌کنن که رضایت کامل داشته باشی. <br /> اونا نه‌تنها پاسخ می‌دن،
            بلکه مشکلات رو پیگیری می‌کنن، نظرات رو منتقل می‌کنن و از رضایتت
            مطمئن می‌شن.
          </Sections>

          <Sections
            title={"تیم محتوای دیجیتال و بلاگ"}
            revers={true}
            img={"./images/about-us-image/4.png"}
          >
            این تیم مغز دانای تک‌شاپه! <br /> کارشون تولید محتواهایی باکیفیت و
            آموزنده‌ست: از راهنمای خرید لپ‌تاپ گرفته تا مقایسه موبایل‌های جدید،
            بررسی تخصصی گجت‌ها، اخبار فناوری و مقالات بلاگ. <br /> هدف اصلی؟ کمک
            به تو برای انتخاب بهتر و خرید آگاهانه‌تر. محتوایی که می‌خونی حاصل
            ساعت‌ها تحقیق و علاقه‌مندی این تیم به دنیای تکنولوژیه.
          </Sections>

          <Sections
            title={"تیم مارکتینگ و تبلیغات"}
            revers={false}
            img={"./images/about-us-image/5.png"}
          >
            هیاهوی دیجیتالی برند ما، از اینجا شروع می‌شه. <br /> کمپین‌های
            تخفیف، معرفی محصولات جدید، حضور در شبکه‌های اجتماعی، طراحی تبلیغات
            خلاقانه و جذب مخاطب جدید، همشون زیر نظر این تیم انجام می‌شن.
            <br />
            اینا باعث می‌شن تک‌شاپ فقط یه فروشگاه نباشه، بلکه یه برند پویا،
            به‌روز و باحال باشه!
          </Sections>
        </div>

        <section className={styles["social-media"]}>
          <h4>
            شبکه های اجتماعی
            <Link href={"index.html"}>تک شاپ</Link>
          </h4>
          <div className={styles["icon-wrapper"]}>
            <div className={styles["social-media_items"]}>
              <svg
                width="36"
                height="36"
                viewBox="0 0 36 36"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M25.5 3H10.5C6.35786 3 3 6.35786 3 10.5V25.5C3 29.6421 6.35786 33 10.5 33H25.5C29.6421 33 33 29.6421 33 25.5V10.5C33 6.35786 29.6421 3 25.5 3Z"
                  stroke="#831FC1"
                  strokeWidth="2"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                ></path>
                <path
                  d="M26.2496 9.75H26.2646M23.9996 17.055C24.1847 18.3034 23.9714 19.5783 23.3902 20.6985C22.8089 21.8187 21.8893 22.7271 20.762 23.2945C19.6347 23.8619 18.3572 24.0594 17.1112 23.8589C15.8652 23.6584 14.7142 23.0701 13.8218 22.1777C12.9294 21.2854 12.3412 20.1343 12.1407 18.8883C11.9402 17.6423 12.1377 16.3648 12.7051 15.2376C13.2724 14.1103 14.1808 13.1906 15.301 12.6094C16.4212 12.0281 17.6962 11.8149 18.9446 12C20.2179 12.1888 21.3968 12.7822 22.3071 13.6925C23.2174 14.6027 23.8107 15.7816 23.9996 17.055Z"
                  stroke="#831FC1"
                  strokeWidth="2"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                ></path>
              </svg>
            </div>
            <div className={styles["social-media_items"]}>
              <svg
                width="36"
                height="36"
                viewBox="0 0 36 36"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M10.2864 24.1715C8.45028 25.6138 6.34276 26.6719 4.0893 27.2829C3.84109 27.373 3.62664 27.5374 3.47509 27.7536C3.32353 27.9698 3.24223 28.2275 3.24223 28.4915C3.24223 28.7556 3.32353 29.0132 3.47509 29.2294C3.62664 29.4457 3.84109 29.61 4.0893 29.7001C21.8836 37.0029 33.1979 25.7144 31.475 13.1915L34.355 7.22581H31.0122C26.8464 2.10866 15.7893 2.36581 17.615 13.2687C17.615 13.2687 11.7007 14.3229 4.14072 6.89152C3.96585 6.71887 3.74515 6.59995 3.50478 6.54885C3.2644 6.49775 3.01442 6.5166 2.78443 6.60319C2.55444 6.68977 2.35408 6.84045 2.20709 7.03739C2.06009 7.23432 1.97261 7.46926 1.95501 7.71438C1.15564 11.0003 1.55568 14.4636 3.0831 17.4807C4.61053 20.4979 7.16496 22.8706 10.2864 24.1715Z"
                  stroke="#831FC1"
                  strokeWidth="2"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                ></path>
              </svg>
            </div>
            <div className={styles["social-media_items"]}>
              <svg
                width="40"
                height="40"
                viewBox="0 0 40 40"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M30.0007 13.3333L8.33398 20.8333L15.834 23.3333M30.0007 13.3333L15.834 23.3333M30.0007 13.3333L23.334 30.8333L15.834 23.3333"
                  stroke="#831FC1"
                  strokeWidth="2"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                ></path>
                <path
                  d="M20.0007 36.6666C29.2057 36.6666 36.6673 29.2049 36.6673 19.9999C36.6673 10.7949 29.2057 3.33325 20.0007 3.33325C10.7957 3.33325 3.33398 10.7949 3.33398 19.9999C3.33398 29.2049 10.7957 36.6666 20.0007 36.6666Z"
                  stroke="#831FC1"
                  strokeWidth="2"
                  strokeLinecap="round"
                  strokeLinejoin="round"
                ></path>
              </svg>
            </div>
            <div className={styles["social-media_items"]}>
              <svg
                width="36"
                height="36"
                viewBox="0 0 36 36"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clipPath="url(#clip0_1025_12721)">
                  <path
                    d="M1.28516 32.1428V3.85707C1.28516 3.17509 1.55607 2.52103 2.03831 2.0388C2.52055 1.55656 3.1746 1.28564 3.85658 1.28564H32.1423C32.8243 1.28564 33.4783 1.55656 33.9606 2.0388C34.4428 2.52103 34.7137 3.17509 34.7137 3.85707V32.1428C34.7137 32.8248 34.4428 33.4788 33.9606 33.9611C33.4783 34.4433 32.8243 34.7142 32.1423 34.7142H24.428V22.5256H26.2537C26.6697 22.5256 27.0687 22.3604 27.3629 22.0662C27.657 21.7721 27.8223 21.3731 27.8223 20.9571V18.9771C27.8223 18.5611 27.657 18.1621 27.3629 17.8679C27.0687 17.5738 26.6697 17.4085 26.2537 17.4085H24.5309V14.9914C24.5309 12.8314 25.508 12.8314 26.4852 12.8314H27.7452C27.9521 12.8399 28.1584 12.8028 28.3495 12.7229C28.5405 12.6429 28.7117 12.5219 28.8509 12.3685C29.0003 12.2262 29.1186 12.0545 29.1983 11.8642C29.2779 11.6739 29.3173 11.4691 29.3137 11.2628V9.35993C29.3206 9.15054 29.2861 8.94185 29.2123 8.74579C29.1384 8.54973 29.0267 8.37014 28.8834 8.2173C28.7401 8.06446 28.5681 7.94136 28.3772 7.85504C28.1863 7.76871 27.9803 7.72086 27.7709 7.71422H24.8137C23.9509 7.68178 23.0913 7.83703 22.2943 8.16925C21.4973 8.50147 20.7819 9.00273 20.1976 9.63842C19.6132 10.2741 19.1738 11.0291 18.9098 11.8512C18.6457 12.6732 18.5632 13.5429 18.668 14.3999V17.4085H17.0223C16.8142 17.4051 16.6074 17.4431 16.4141 17.5204C16.2208 17.5977 16.0449 17.7127 15.8965 17.8587C15.7481 18.0047 15.6303 18.1788 15.5498 18.3708C15.4694 18.5628 15.428 18.7689 15.428 18.9771V20.9571C15.428 21.1652 15.4694 21.3713 15.5498 21.5633C15.6303 21.7553 15.7481 21.9294 15.8965 22.0754C16.0449 22.2214 16.2208 22.3364 16.4141 22.4137C16.6074 22.491 16.8142 22.5291 17.0223 22.5256H18.668V34.7142H3.85658C3.1746 34.7142 2.52055 34.4433 2.03831 33.9611C1.55607 33.4788 1.28516 32.8248 1.28516 32.1428Z"
                    stroke="#831FC1"
                    strokeWidth="2"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  ></path>
                </g>
                <defs>
                  <clipPath id="clip0_1025_12721">
                    <rect width="36" height="36" fill="white"></rect>
                  </clipPath>
                </defs>
              </svg>
            </div>
          </div>

          <div className={styles["about-us-email"]}>
            <div className={styles["about-us-email-item"]}>
              <span className={styles["abous-us-icon"]}>
                <svg
                  width="48"
                  height="48"
                  viewBox="0 0 48 48"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M25.1196 41.64C24.7932 41.8744 24.4014 42.0005 23.9996 42.0005C23.5977 42.0005 23.206 41.8744 22.8796 41.64C13.2216 34.756 2.97156 20.596 13.3336 10.364C16.1782 7.5657 20.0092 5.99825 23.9996 6C27.9996 6 31.8376 7.57 34.6656 10.362C45.0276 20.594 34.7776 34.752 25.1196 41.64Z"
                    stroke="#831FC1"
                    strokeWidth="3"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  ></path>
                  <path
                    d="M24 24C25.0609 24 26.0783 23.5786 26.8284 22.8284C27.5786 22.0783 28 21.0609 28 20C28 18.9391 27.5786 17.9217 26.8284 17.1716C26.0783 16.4214 25.0609 16 24 16C22.9391 16 21.9217 16.4214 21.1716 17.1716C20.4214 17.9217 20 18.9391 20 20C20 21.0609 20.4214 22.0783 21.1716 22.8284C21.9217 23.5786 22.9391 24 24 24Z"
                    stroke="#831FC1"
                    strokeWidth="3"
                    strokeLinecap="round"
                    strokeLinejoin="round"
                  ></path>
                </svg>
              </span>

              <h5>پست الکترونیکی : </h5>
              <p>takshoppp@gmail.com</p>
            </div>
            <div className={styles["about-us-email-item"]}>
              <span className={styles["abous-us-icon"]}>
                <svg
                  width="49"
                  height="48"
                  viewBox="0 0 49 48"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M11.6427 15.7739C11.0697 11.9999 13.7307 8.60992 17.7957 7.36792C18.5171 7.14886 19.2948 7.21234 19.9711 7.54548C20.6474 7.87862 21.1717 8.45649 21.4377 9.16192L22.7427 12.6419C22.9528 13.2018 22.9908 13.8116 22.8518 14.3932C22.7128 14.9748 22.4032 15.5016 21.9627 15.9059L18.0807 19.4609C17.8891 19.6363 17.7464 19.8585 17.6664 20.1057C17.5865 20.3528 17.5721 20.6165 17.6247 20.8709L17.6607 21.0269L17.7537 21.4169C18.2377 23.3115 18.9733 25.1327 19.9407 26.8319C20.9971 28.6362 22.3064 30.2799 23.8287 31.7129L23.9487 31.8209C24.1425 31.9929 24.3776 32.1118 24.631 32.166C24.8844 32.2201 25.1475 32.2077 25.3947 32.1299L30.4137 30.5489C30.9841 30.3698 31.595 30.3653 32.168 30.5358C32.741 30.7063 33.25 31.0441 33.6297 31.5059L36.0057 34.3889C36.9957 35.5889 36.8757 37.3529 35.7387 38.4119C32.6277 41.3129 28.3497 41.9069 25.3737 39.5159C21.7243 36.575 18.6488 32.9859 16.3017 28.9289C13.9317 24.8773 12.3529 20.4138 11.6427 15.7739ZM20.7687 21.0689L23.9847 18.1169C24.8662 17.3085 25.486 16.2551 25.7645 15.0919C26.043 13.9288 25.9675 12.7089 25.5477 11.5889L24.2457 8.10892C23.7116 6.68924 22.6571 5.52611 21.2964 4.85579C19.9357 4.18547 18.3708 4.05823 16.9197 4.49992C11.8707 6.04492 7.81773 10.5719 8.67573 16.2269C9.27573 20.1749 10.6587 25.1969 13.7097 30.4409C16.2421 34.8153 19.5596 38.685 23.4957 41.8559C27.9597 45.4409 33.9177 44.2169 37.7877 40.6109C38.8951 39.5799 39.5672 38.1651 39.667 36.6554C39.7668 35.1457 39.2867 33.6548 38.3247 32.4869L35.9487 29.6009C35.1886 28.6784 34.1703 28.0039 33.0243 27.6639C31.8783 27.324 30.6569 27.3341 29.5167 27.6929L25.3497 29.0039C24.2738 27.8947 23.3313 26.6633 22.5417 25.3349C21.7798 23.9916 21.1853 22.5599 20.7717 21.0719"
                    fill="#831FC1"
                  ></path>
                </svg>
              </span>
              <h5> شماره تماس: </h5>
              <p>021-12345678</p>
            </div>
          </div>

          <div className="store-locatin">
            <span>نشانی:</span>
            <p>تهران - ولیعصر - پلاک 188</p>

            <div className="store-map">
              <img src="./images/store-map.png" alt="" />
            </div>
          </div>
        </section>
      </div>
    </div>
  );
}

export default page;
